using System.Text.RegularExpressions;

namespace PasswordCrack.Settings
{
    public class BruteForceSettings
    {
        public string StartPassword { get; set; } = "a";

        public char[] Chars { get; set; } = { 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'á', 'é', 'í', 'ó', 'ö', 'ő', 'ú', 'ü', 'ű', 'Á', 'É', 'Í', 'Ó', 'Ö', 'Ő', 'Ú', 'Ü', 'Ű', 'ä', 'Ä', 'â', 'Â', 'ą', 'Ą', 'ă', 'Ă', 'ß', 'č', 'Č', 'ć', 'Ć', 'ç', 'Ç', 'đ', 'Đ', 'ď', 'Ď', 'ě', 'Ě', 'ę', 'Ę', 'ë', 'Ë', 'î', 'Î', 'ł', 'Ł', 'ĺ', 'Ĺ', 'ľ', 'Ľ', 'ń', 'Ń', 'ň', 'Ň', 'ô', 'Ô', 'ŕ', 'Ŕ', 'ř', 'Ř', 'š', 'Š', 'ş', 'Ş', 'ś', 'Ś', 'ť', 'Ť', 'ţ', 'Ţ', 'ů', 'Ů', 'ý', 'Ý', 'ż', 'Ż', 'ž', 'Ž', 'ź', 'Ź', ' ', '§', '\'', '"', '+', '!', '%', '/', '=', '~', 'ˇ', '^', '˘', '°', '˛', '`', '˙', '´', '˝', '¨', '¸', '÷', '×', '€', '$', '¤', ',', '.', '-', ';', '>', '*', '<', '[', ']', '?', ':', '_', '#', '&', '@', '\\', '|' };

        public Regex RegEx { get; set; } = new Regex(".*");
    }
}
